In [1]:
####DATA CLEANING

In [2]:
import numpy as np
import pandas as pd

In [3]:
###PANDAS UTILITY FUNCTIONS

In [4]:
pd.isnull(np.nan)

True

In [5]:
pd.isnull(None)

True

In [6]:
pd.isna(np.nan)

True

In [7]:
pd.isna(None)

True

In [8]:
pd.notnull(None)

False

In [9]:
pd.notnull(np.nan)

False

In [10]:
pd.notnull(13)

True

In [11]:
#### THEY ALSO WORK WITH SERIES AND DATAFRAMES

In [12]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [13]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
    
    
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [14]:
###PANDAS OPERATIONS WITH MISSING VALUES

In [15]:
pd.Series([1, 2, np.nan]).count()

2

In [16]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [17]:
pd.Series([2, 2, np.nan]).mean()

2.0

In [18]:
### FILTERING MISSING DATA

In [19]:
s = pd.Series([1, 2 , 3, np.nan, np.nan, 4])

In [21]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [22]:
pd.notnull(s).count() ##inclued total number of elements including null and not null

6

In [23]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [24]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [25]:
s.notnull() ####YOU CAN USE METHOD NOTNULL FOR S

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [26]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [28]:
####DROPPING NULL VALUES

In [31]:
pd.notnull(s).sum()  ####RETURNS HOW MANY NOT NULL VALUES THERE ARE

4

In [32]:
###DROPPING NULL VALUES

In [33]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [35]:
###dropping null values on DataFrames

In [37]:
df = pd.DataFrame(
    {
        'Column A' : [1, np.nan, 30, np.nan],
        'Column B' : [2, 8, 31, np.nan],
        'Column C' : [np.nan, 9, 32, 100],
        'Column D' : [5, 8, 34, 110]
        
    }
    
)

In [38]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [39]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [43]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [45]:
df.dropna() ###drops all the ROWS, where there is a null value

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [46]:
df.dropna(axis = 1)  ##AXIS 1  is columns

   Column D
0         5
1         8
2        34
3       110

In [47]:
df2 = pd.DataFrame(
{
    'Column A': [1, np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
}
)

In [48]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [49]:
df.dropna(how = 'all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [50]:
df.dropna(how = 'any')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [51]:
df.dropna(thresh = 3) ##drop all values that a less than 3

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [53]:
df.dropna(thresh = 3 , axis = 'columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

In [54]:
### FILLING NULL VALUES

In [55]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [56]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [57]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [58]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [59]:
###FILLING NULLS WITH CONTIGUOUS (CLOSE) VALUES

In [60]:
s.fillna(method = 'ffill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_14424\1946733153.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method = 'ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [61]:
s.fillna(method='bfill') ### BUT THIS CAN STILL LEAVE NULL VALUES AT THE BEGINNIN OR AT THE END

C:\Users\Admin\AppData\Local\Temp\ipykernel_14424\1641295691.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [62]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method = 'ffill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_14424\1811012050.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 3, np.nan, 9]).fillna(method = 'ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [63]:
pd.Series([1, np.nan, 3, np.nan,]).fillna(method = 'bfill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_14424\2671784480.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([1, np.nan, 3, np.nan,]).fillna(method = 'bfill')

0    1.0
1    3.0
2    3.0
3    NaN
dtype: float64

In [64]:
###FILLING NULL VALUES ON DATAFRAMES

In [65]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [68]:
df.fillna( { 'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [69]:
df.fillna(method = 'ffill', axis = 0)

C:\Users\Admin\AppData\Local\Temp\ipykernel_14424\3382854290.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis = 0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [70]:
df.fillna(method = 'bfill', axis = 1)

C:\Users\Admin\AppData\Local\Temp\ipykernel_14424\2698027912.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill', axis = 1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       5.0       5.0
1       8.0       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3     100.0     100.0     100.0     110.0

In [71]:
##CHECKING IF THERE ARE NAs

In [72]:
s.dropna().count()

4

In [73]:
missing_values = len(s.dropna()) != len(s)
missing_values

True

In [74]:
len(s)

6

In [75]:
s.count() ###NON NULL ELEMENTS

4

In [76]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [77]:
### more pythonic solution any

In [78]:
pd.Series([True, False, False]).any()

True

In [79]:
pd.Series([True, False, False]).all()

False

In [80]:
pd.Series([True, True, True]).all()

True

In [81]:
pd

In [82]:
pd.Series([1, np.nan]).isnull().any()

True

In [83]:
pd.Series([1,2]).isnull().any()

False

In [84]:
s.isnull().any()

True

In [85]:
###CLEANING NOT NULL VALUES

In [86]:
####

In [87]:
import numpy as np
import pandas as pd

In [88]:
df = pd.DataFrame({
    
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25]
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [89]:
#### 290 and ? are strange here, so let's clean it

In [90]:
##Finding unique values

In [91]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [92]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [93]:
df['Sex'].value_counts()

Sex
F    2
M    1
D    1
?    1
Name: count, dtype: int64

In [94]:
df['Sex'].replace({'D': 'F', 'N': 'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [95]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [96]:

df.replace({
    'Sex': {
        'D': 'F',
        'N': 'M'
        
    },
    'Age': {
        290:29
    }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [97]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [99]:
df[df['Age'] >100]

  Sex  Age
3   D  290

In [102]:
df.loc[df['Age'] > 100] = df.loc[df['Age'] > 100] / 10

In [103]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

In [104]:
### DUPLICATES

In [105]:
ambassadors = pd.Series ([
    
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
    
], index = [
    'Gerard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Witting',
    'Peter Ammon',
    'Klaus Scharioth'
]
)

In [106]:
ambassadors

Gerard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Witting                Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [107]:
ambassadors.duplicated()

Gerard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Witting         False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [108]:
ambassadors.duplicated(keep = 'last')

Gerard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Witting          True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [109]:
ambassadors.duplicated(keep = False)

Gerard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Witting          True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [110]:
ambassadors.drop_duplicates()

Gerard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Witting                Germany
dtype: object

In [111]:
ambassadors.drop_duplicates(keep ='last')

Gerard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [112]:
ambassadors.drop_duplicates(keep = False)

Gerard Araud          France
Armando Varricchio     Italy
dtype: object

In [113]:
###DUPLICATES IN DATAFRAMES

In [114]:
players = pd.DataFrame({
    'Name':[
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Antony',
        'Kobe Bryant'
    ], 
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SG',
        'SF'
    ]
})

In [115]:
players

             Name Pos
0     Kobe Bryant  SG
1    LeBron James  SF
2     Kobe Bryant  SG
3  Carmelo Antony  SG
4     Kobe Bryant  SF

In [116]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [117]:
players.duplicated(subset = 'Name')

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [119]:
players.duplicated(subset = ['Name'], keep = 'last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [120]:
#####TEXT HANDLING
###IT USED TO REQUIRE 99 % OF THE TIME BEFORE DATA ENTRY WASN'T DONE BY MACHINES

In [122]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US_1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970_M_  IT_1',
        '1985_F_I T_2'
    ]
})

In [123]:
df

            Data
0    1987_M_US_1
1   1990?_M_UK_1
2    1992_F_US_2
3  1970_M_  IT_1
4   1985_F_I T_2

In [124]:
##### PANDAS CAN SPLIT THE UNDERSCORES

In [125]:
df['Data'].str.split('_')

0      [1987, M, US, 1]
1     [1990?, M, UK, 1]
2      [1992, F, US, 2]
3    [1970, M,   IT, 1]
4     [1985, F, I T, 2]
Name: Data, dtype: object

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 172.0+ bytes

In [127]:
df['Data'].str.split('_', expand = True)

       0  1     2  3
0   1987  M    US  1
1  1990?  M    UK  1
2   1992  F    US  2
3   1970  M    IT  1
4   1985  F   I T  2

In [128]:
df = df['Data'].str.split('_', expand = True)

In [129]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']

In [130]:
df

    Year Sex Country No Children
0   1987   M      US           1
1  1990?   M      UK           1
2   1992   F      US           2
3   1970   M      IT           1
4   1985   F     I T           2

In [131]:
df['Year'].str.contains('\?')

0    False
1     True
2    False
3    False
4    False
Name: Year, dtype: bool

In [133]:
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [134]:
df['Country'].str.replace(' ', '')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [137]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

ValueError: Cannot use a callable replacement when regex=False

In [138]:
df['Country'].str.strip()

0     US
1     UK
2     US
3     IT
4    I T
Name: Country, dtype: object

In [139]:
##### MORE VISUALIZATIONS

In [140]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
#### 3 14 00 video